using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Yesodot
{
    // הקובץ הראשי של הפרויקט.
    // הדוגמאות של כל פרק נמצאות בקובץ משלו, בתיקייה של הפרק.
    internal class Program
    {
        static void Main(string[] args)
        {
            // איך מריצים דוגמה:
            // שלב 1: כאן, יש להסיר את סימן ההערה מהשורה של הפרק הרצוי.
            // שלב 2: בקובץ של הפרק, בפעולת ההרצה שבראשו, יש להסיר את סימן ההערה מהדוגמה הרצויה.
            // לפני שעוברים לפרק אחר, מחזירים את סימן ההערה לשורה הקודמת.

            // פרקים 1 ו-2: הוראות הדפסה ומשתנים, אופרטורים וביטויים לוגיים
            // הקובץ נמצא בתיקייה הבאה:
            // Ch1_2
            // Chapter1_2.Run();

            // פרקים 3 ו-4: הספרייה המתמטית ומחלקת אקראי, משפטי תנאי
            // הקובץ נמצא בתיקייה הבאה:
            // Ch3_4
            // Chapter3_4.Run();

            // פרק 5: לולאות
            // הקובץ נמצא בתיקייה הבאה:
            // Ch5
             Chapter5.Run();
        }
    }
}
